#include<iostream>
#include<vector>
#include<conio.h>
#include<stdlib.h>
#include<windows.h>
#include<time.h>
using namespace std;
const int MAX_N=1024;
struct Data
{
    string q;
    string a;
};
vector<Data> d;
bool taken[MAX_N];
int cnt;
void init()
{
    d.push_back({"Христо Ботев", "романтизъм (преди Освобождението)"});
    d.push_back({"Иван Вазов", "реализъм, \"Патриарх на българската литература\" (Освобождение до Първа световна)"});
    d.push_back({"Алеко Константинов", "социален реализъм, \"Щастливеца\" (Освобождение до Първа световна)"});
    d.push_back({"Пенчо Славейков", "модернизъм (Освобождение до Първа световна)"});
    d.push_back({"Пейо Яворов", "символизъм (Освобождение до Първа световна)"});
    d.push_back({"Димчо Дебелянов", "симвоолизъм (Освобождение до Първа световна)"});
    d.push_back({"Елин Пелин", "реализъм, \"Певец на българското село\" (Освобождение до Втора световна)"});
    d.push_back({"Христо Смирненски", "постсимволизъм, \"Син на града\" (Първа световна до Втора световна)"});
    d.push_back({"Гео Милев", "експресионизъм (Първа световна до Втора световна)"});
    d.push_back({"Атанас Далчев", "диаболизъм (Първа световна до Втора световна)"});
    d.push_back({"Елисавета Багряна", "постсимволизъм (след Първа световна)"});
    d.push_back({"Йордан Йовков", "реализъм (Първа световна до Втора световна)"});
    d.push_back({"Никола Вапцаров", "реализъм (Първа световна до Втора световна)"});
    d.push_back({"Димитър Талев", "реализъм (след Първа световна)"});
    d.push_back({"Димитър Димов", "реализъм (след Първа световна)"});


    d.push_back({"Майце си", "Христо Ботев, елегия"});
    d.push_back({"Към брата си", "Христо Ботев, елегия"});
    d.push_back({"Елегия", "Христо Ботев, елегия"});
    d.push_back({"Борба", "Христо Ботев, стихотворение"});
    d.push_back({"До моето първо либе", "Христо Ботев, стихотворение"});
    d.push_back({"На прощаване", "Христо Ботев, поема"});
    d.push_back({"Хаджи Димитър", "Христо Ботев, балада"});
    d.push_back({"Моята молитва", "Христо Ботев, стихотворение"});
    d.push_back({"Обесването на Васил Левски", "Христо Ботев, елегия"});

    d.push_back({"Под игото", "Иван Вазов, роман"});
    d.push_back({"Чичовци", "Иван Вазов, повест"});
    d.push_back({"Дядо Йоцо гледа", "Иван Вазов, ракзаз"});
    d.push_back({"Българският език", "Иван Вазов, ода"});
    d.push_back({"Линее нашто поколенье", "Иван Вазов, гражданска елегия"});
    d.push_back({"Елате ни вижте", "Иван Вазов, гражданска елегия"});
    d.push_back({"При Рилския манастир", "Иван Вазов, ода"});
    d.push_back({"Отечество любезно, как хубаво си ти", "Иван Вазов, гражданска елегия"});
    d.push_back({"Левски", "Иван Вазов,  ода (Епопея на забравените)"});
    d.push_back({"Паисий", "Иван Вазов, ода (Епопея на забравените)"});
    d.push_back({"Кочо", "Иван Вазов, ода (Епопея на забравените)"});
    d.push_back({"Опълченците на Шипка", "Иван Вазов, ода (Епопея на забравените)"});


    /*d.push_back({"Бай Ганьо", "Алеко Константинов"});
    d.push_back({"Разни хора, разни идеали", "Алеко Константинов, фейлетон"});*/

    d.push_back({"Cis Moll", "Пенчо Славейков, философска поема"});
    d.push_back({"Ни лъх не дъхва над полени", "Пенчо Славейков, лирическа миниатюра"});
    d.push_back({"Спи езерото", "Пенчо Славейков, лирическа миниатюра"});
    d.push_back({"Самотен гроб в самотен кът", "Пенчо Славейков, лирическа миниатюра"});
    d.push_back({"Ралица", "Пенчо Славейков, поема"});

    d.push_back({"Градушка", "Пейо Яворов, поема"});
    d.push_back({"Заточеници", "Пейо Яворов, елегия"});
    d.push_back({"Ще бъдеш в бяло", "Пейо Яворов, любовно стихотворение"});
    d.push_back({"Две хубави очи", "Пейо Яворов, любовно стихотворение"});
    d.push_back({"Сенки", "Пейо Яворов, стихотворение"});
    d.push_back({"Две души", "Пейо Яворов, стихотворение"});
    d.push_back({"Стон (на Лора)", "Пейо Яворов, любовно стихотворение"});
    d.push_back({"Песента на човека", "Пейо Яворов, стихотворение"});
    d.push_back({"Маска", "Пейо Яворов, стихотворение"});

    d.push_back({"Черна песен", "Димчо Дебелянов, елегия"});
    d.push_back({"Пловдив", "Димчо Дебелянов, сонет"});
    d.push_back({"Да се завърнеш в бащината къща", "Димчо Дебелянов, елегия"});
    d.push_back({"Помниш ли, помниш ли", "Димчо Дебелянов, елегия"});
    d.push_back({"Спи градът", "Димчо Дебелянов, елегия"});
    d.push_back({"Миг", "Димчо Дебелянов, елегия"});
    d.push_back({"Един убит", "Димчо Дебелянов, елегия"});
    d.push_back({"Сиротна песен", "Димчо Дебелянов, елегия"});
    d.push_back({"Тиха победа", "Димчо Дебелянов, елегия"});

    d.push_back({"Гераците", "Елин Пелин, повест"});
    d.push_back({"На оня свят", "Елин Пелин, разказ"});
    d.push_back({"Мечтатели", "Елин Пелин, разказ"});
    d.push_back({"Ветрената мелница", "Елин Пелин, разказ"});
    d.push_back({"Косачи", "Елин Пелин, разказ"});
    d.push_back({"Задушница", "Елин Пелин, разказ"});
    d.push_back({"Андрешко", "Елин Пелин, разказ"});
    d.push_back({"Занемелите камбани", "Елин Пелин, разказ"});

    d.push_back({"Цветарка", "Христо Смирненски, стихотворение (Да бъде ден!)"});
    d.push_back({"Да бъде ден!", "Христо Смирненски, стихотворение (Да бъде ден!)"});
    d.push_back({"Ний", "Христо Смирненски, стихотворение (Да бъде ден!)"});
    d.push_back({"Йохан", "Христо Смирненски, поема (Да бъде ден!)"});
    d.push_back({"Старият музикант", "Христо Смирненски, елегия (Децата на града)"});
    d.push_back({"Юноша", "Христо Смирненски, стихотворение (Зимни вечери)"});

    d.push_back({"Септември", "Гео Милев, поема"});

    d.push_back({"Къщата", "Атанас Далчев, стихотворение"});
    d.push_back({"Камък", "Атанас Далчев, стихотворение"});
    d.push_back({"Болница", "Атанас Далчев, стихотворение"});
    d.push_back({"Стаята", "Атанас Далчев, стихотворение"});
    d.push_back({"Прозорец", "Атанас Далчев, стихотворение"});
    d.push_back({"Повест", "Атанас Далчев, стихотворение"});
    d.push_back({"Дяволско", "Атанас Далчев, елегия"});

    d.push_back({"Кукувица", "Елисавета Багряна, стихотворение"});
    d.push_back({"Потомка", "Елисавета Багряна, стихотворение"});
    d.push_back({"Вечната", "Елисавета Багряна, стихотворение"});
    d.push_back({"Стихии", "Елисавета Багряна, стихотворение"});

    d.push_back({"Песента на колелетата", "Йордан Йовков, разказ"});
    d.push_back({"Последна радост", "Йордан Йовков, разказ"});
    d.push_back({"Шибил", "Йордан Йовков, разказ"});
    d.push_back({"През чумавото", "Йордан Йовков, разказ"});
    d.push_back({"Индже", "Йордан Йовков, разказ"});
    d.push_back({"Албена", "Йордан Йовков, разказ"});
    d.push_back({"Другоселец", "Йордан Йовков, разказ"});
    d.push_back({"Серафим", "Йордан Йовков, разказ"});

    d.push_back({"Вяра", "Никола Вапцаров, стихотворение"});
    d.push_back({"История", "Никола Вапцаров, стихотворение"});
    d.push_back({"Кино", "Никола Вапцаров, стихотворение"});
    d.push_back({"Песен за човека", "Никола Вапцаров, поема"});
    d.push_back({"Писмо", "Никола Вапцаров, стихотворение"});
    d.push_back({"Завод", "Никола Вапцаров, стихотворение"});
    d.push_back({"Сън", "Никола Вапцаров, стихотворение"});
    d.push_back({"Прощално", "Никола Вапцаров, стихотворение"});
    d.push_back({"Борбата е безмилостно жестокост", "Никола Вапцаров, стихотворение"});

    d.push_back({"Железният светилник", "Димитър Талев, роман"});

    d.push_back({"Тютюн", "Димитър Димов, роман"});

    d.push_back({"Иван Кралича (Бойчо Огнянов)", "Под игото, Иван Вазов"});
    d.push_back({"Рада Госпожина", "Под игото, Иван Вазов"});
    d.push_back({"Доктор Соколов", "Под игото, Иван Вазов"});
    d.push_back({"чорбаджи Марко", "Под игото, Иван Вазов"});
    d.push_back({"Мичо Бейзадето", "Под игото, Иван Вазов"});
    d.push_back({"Кириак Стефчов", "Под игото, Иван Вазов"});
    d.push_back({"чорбаджи Юрдан Диамандиев", "Под игото, Иван Вазов"});
    d.push_back({"дядо Стоян", "Под игото, Иван Вазов"});
    d.push_back({"Марийка", "Под игото, Иван Вазов"});
    d.push_back({"Дякон Викентий", "Под игото, Иван Вазов"});
    d.push_back({"Колчо Слепецът", "Под игото, Иван Вазов"});
    d.push_back({"Мунчо", "Под игото, Иван Вазов"});
    d.push_back({"Иван Боримечката", "Под игото, Иван Вазов"});
    d.push_back({"отец Йеротей", "Под игото, Иван Вазов"});
    d.push_back({"Тодор Каблешков", "Под игото, Иван Вазов"});

    d.push_back({"Иван Селямсъзът", "Чичовци, Иван Вазов"});
    d.push_back({"Варлаам Копринарката", "Чичовци, Иван Вазов"});
    d.push_back({"даскал Гатьо", "Чичовци, Иван Вазов"});
    d.push_back({"Авраамчо Разпопчето", "Чичовци, Иван Вазов"});
    d.push_back({"Мирончо", "Чичовци, Иван Вазов"});
    d.push_back({"господин Фратю", "Чичовци, Иван Вазов"});
    d.push_back({"Иванчо Йотата", "Чичовци, Иван Вазов"});
    d.push_back({"хаджи Атанасии", "Чичовци, Иван Вазов"});
    d.push_back({"хаджи Смион", "Чичовци, Иван Вазов"});

    d.push_back({"Дядо Йоцо", "Дядо Йоцо гледа, Иван вазов"});

    d.push_back({"Бай Ганьо", "Бай Ганьо, Алеко Константинов (отрицателен)"});
    d.push_back({"Гочоолу", "Бай Ганьо, Алеко Константинов (отрицателен)"});
    d.push_back({"Бочоолу", "Бай Ганьо, Алеко Константинов (отрицателен)"});
    d.push_back({"Данко Харсъзина", "Бай Ганьо, Алеко Константинов (отрицателен)"});
    d.push_back({"Иваница Граматик", "Бай Ганьо, Алеко Константинов (Алеко е прототипа)"});

    d.push_back({"Йордан Геракът", "Гераците, Елин Пелин"});
    d.push_back({"баба Марга", "Гераците, Елин Пелин"});
    d.push_back({"Елка", "Гераците, Елин Пелин"});
    d.push_back({"Йовка", "Гераците, Елин Пелин"});
    d.push_back({"Петър", "Гераците, Елин Пелин"});
    d.push_back({"Павел", "Гераците, Елин Пелин"});
    d.push_back({"Божан", "Гераците, Елин Пелин"});
    d.push_back({"Захаринчо", "Гераците, Елин Пелин"});
    d.push_back({"дядо Матей Маргалака", "Гераците, Елин Пелин"});

    d.push_back({"дядо Матейко", "На оня свят, Елин Пелин"});
    d.push_back({"баба Йова", "На оня свят, Елин Пелин"});

    d.push_back({"Рустем", "Мечтатели, Елин Пелин"});
    d.push_back({"чичо Горан", "Мечтатели, Елин Пелин"});
    d.push_back({"Акима", "Мечтатели, Елин Пелин"});

    d.push_back({"Дядо Корчан", "Ветрената мелница, Елин Пелин"});
    d.push_back({"Христина", "Ветрената мелница, Елин Пелин"});
    d.push_back({"Лазар Дъбака", "Ветрената мелница, Елин Пелин"});

    d.push_back({"Лазо", "Косачи, Елин Пелин"});
    d.push_back({"Благолажа", "Косачи, Елин Пелин"});
    d.push_back({"Пенка", "Косачи, Елин Пелин"});

    d.push_back({"Станчо Поляка", "Задушница, Елин Пелин"});
    d.push_back({"Стоилка", "Задушница, Елин Пелин"});

    d.push_back({"Андрешко", "Андрешко, Елин Пелин"});

    d.push_back({"отец Йоаким", "Занемелите Камбани, Елин Пелин"});

    d.push_back({"поп Андрей", "Септември, Гео Милев"});

    d.push_back({"Сали Яшар", "Песента на колелетата, Йордан Йовков"});
    d.push_back({"Джапар", "Песента на колелетата, Йордан Йовков"});
    d.push_back({"Мурад бей", "Песента на колелетата, Йордан Йовков"});
    d.push_back({"Шакире", "Песента на колелетата, Йордан Йовков"});

    d.push_back({"Люцкан", "Последна радост, Йордан Йовков"});
    d.push_back({"Цветана", "Последна радост, Йордан Йовков"});
    d.push_back({"Караколев", "Последна радост, Йордан Йовков"});
    d.push_back({"Рачо Самсарът", "Последна радост, Йордан Йовков"});
    d.push_back({"Кръстан", "Последна радост, Йордан Йовков"});
    d.push_back({"дядо Слави", "Последна радост, Йордан Йовков"});

    d.push_back({"Шибил (Мустафа)", "Шибил, Йордан Йовков"});
    d.push_back({"Рада", "Шибил, Йордан Йовков"});
    d.push_back({"Велико кехая", "Шибил, Йордан Йовков"});

    d.push_back({"хаджи Драган", "През чумавото, Йордан Йовков"});
    d.push_back({"Тиха", "През чумавото, Йордан Йовков"});
    d.push_back({"Нейко", "През чумавото, Йордан Йовков"});

    d.push_back({"Индже", "Индже, Йордан Йовков"});
    d.push_back({"Найден (Гърбавото)", "Индже, Йордан Йовков"});
    d.push_back({"Пауна", "Индже, Йордан Йовков"});
    d.push_back({"Сяро барутчията", "Индже, Йордан Йовков"});

    d.push_back({"Албена", "Албена, Йордан Йовков"});
    d.push_back({"Куцар", "Албена, Йордан Йовков"});
    d.push_back({"Нягул", "Албена, Йордан Йовков"});
    d.push_back({"дядо Власю", "Албена, Йордан Йовков"});

    d.push_back({"кмета", "Другоселец, Йордан Йовков"});
    d.push_back({"Торашко", "Другоселец, Йордан Йовков"});
    d.push_back({"Илия", "Другоселец, Йордан Йовков"});

    d.push_back({"Серафим", "Серафим, Йордан Йовков"});
    d.push_back({"Еньо (Кафеджията)", "Серафим, Йордан Йовков"});
    d.push_back({"Павлина", "Серафим, Йордан Йовков"});

    d.push_back({"Стоян Глаушев", "Железният светилник, Димитър Талев (родители)"});
    d.push_back({"Султана Серафимова", "Железният светилник, Димитър Талев (родители)"});
    d.push_back({"Лазар", "Железният светилник, Димитър Талев (деца)"});
    d.push_back({"Нона", "Железният светилник, Димитър Талев (деца)"});
    d.push_back({"Манда", "Железният светилник, Димитър Талев (деца)"});
    d.push_back({"Катерина", "Железният светилник, Димитър Талев (деца)"});
    d.push_back({"Коста (Кочо)", "Железният светилник, Димитър Талев (деца)"});
    d.push_back({"Рафаил Клинече (Рафе Клинче)", "Железният светилник, Димитър Талев"});
    d.push_back({"Ния (Евгения)", "Железният светилник, Димитър Талев"});
    d.push_back({"Авраам Немтур", "Железният светилник, Димитър Талев"});
    d.push_back({"Божана", "Железният светилник, Димитър Талев"});
    d.push_back({"Андрея Бенков", "Железният светилник, Димитър Талев"});
    d.push_back({"Благуна", "Железният светилник, Димитър Талев"});

    d.push_back({"Ирина", "Тютюн, Димитър Димов"});
    d.push_back({"Борис Морев", "Тютюн, Димитър Димов"});
    d.push_back({"Пиер Спиридонов", "Тютюн, Димитър Димов"});
    d.push_back({"Мария", "Тютюн, Димитър Димов"});
    d.push_back({"Зара", "Тютюн, Димитър Димов"});
    d.push_back({"Костов", "Тютюн, Димитър Димов"});
    d.push_back({"Баташки", "Тютюн, Димитър Димов"});
    d.push_back({"Бимби", "Тютюн, Димитър Димов"});
    d.push_back({"Чакъра", "Тютюн, Димитър Димов"});
    d.push_back({"Барутчиев", "Тютюн, Димитър Димов"});
    d.push_back({"г-ца Дитрих", "Тютюн, Димитър Димов"});
    d.push_back({"Прайбиш", "Тютюн, Димитър Димов"});
    d.push_back({"Лила", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"Павел Морев", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"Макс Ешкенази", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"Чингис", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"Шишко", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"Динко", "Тютюн, Димитър Димов (комунисти)"});
    d.push_back({"фон Гайер", "Тютюн, Димитър Димов (немци)"});
    d.push_back({"Лихтенфелд", "Тютюн, Димитър Димов (немци)"});
}
int main()
{
    system("chcp 1251");
    srand(time(NULL));
    init();
    int curr;
    while (1)
    {
        system("cls");
        if (cnt==d.size())
        {
            cnt=0;
            for (int i=0;i<d.size();++i)
            {
                taken[i]=0;
            }
        }
        do
        {
            curr=rand()%d.size();
        }
        while (taken[curr]==1);
        ++cnt;
        taken[curr]=1;
        cout<<cnt<<"/"<<d.size()<<endl;
        cout<<d[curr].q<<endl;
        getch();
        cout<<d[curr].a<<endl;
        getch();

    }
}
